
[StaffRoll]
Staff6L=GUILTY GEAR Xrd -REVELATOR-
Staff8L=CONSUMER VERSION CREDIT
Staff19L=Original Works
Staff21L=石渡 太輔／アークシステムワークス
Staff21_subL=Daisuke Ishiwatari / ARC SYSTEM WORKS
Staff30L=CAST
Staff32L=SOL BADGUY
Staff32R=中田 譲治
Staff32_subR=Jouji Nakata
Staff33L=KY KISKE
Staff33R=草尾 毅
Staff33_subR=Takeshi Kusao
Staff34L=MAY
Staff34R=こおろぎさとみ
Staff34_subR=Satomi Koorogi
Staff35L=MILLIA RAGE
Staff35R=住友 優子
Staff35_subR=Yuuko Sumitomo
Staff36L=CHIPP ZANUFF
Staff36R=川原 慶久
Staff36_subR=Yoshihisa Kawahara
Staff37L=VENOM
Staff37R=諏訪部 順一
Staff37_subR=Junichi Suwabe
Staff38L=POTEMKIN
Staff38R=近藤 隆
Staff38_subR=Takashi Kondou
Staff39L=AXL LOW
Staff39R=難波 圭一
Staff39_subR=Keiichi Nanba
Staff40L=I-NO
Staff40R=井上 喜久子
Staff40_subR=Kikuko Inoue
Staff41L=FAUST
Staff41R=近藤 隆
Staff41_subR=Takashi Kondou
Staff42L=SLAYER
Staff42R=土師 孝也
Staff42_subR=Takaya Hashi
Staff43L=ZATO-1&EDDIE
Staff43R=子安 武人
Staff43_subR=Takehito Koyasu
Staff44L=BEDMAN
Staff44R=緑川 光
Staff44_subR=Hikaru Midorikawa
Staff45L=RAMLETHAL
Staff45R=潘 めぐみ
Staff45_subR=Megumi Han
Staff46L=SIN KISKE
Staff46R=宮崎 一成
Staff46_subR=Issei Miyazaki
Staff47L=ELPHELT
Staff47R=洲崎 綾
Staff47_subR=Aya Suzaki
Staff48L=LEO WHITEFANG
Staff48R=稲田 徹
Staff48_subR=Tetsu Inada
Staff49L=JOHNNY
Staff49R=若本 規夫
Staff49_subR=Norio Wakamoto
Staff50L=JACK-O'
Staff50R=五十嵐 裕美
Staff50_subR=Hiromi Igarashi
Staff51L=JAM KURADOBERI
Staff51R=松嵜 麗
Staff51_subR=Rei Matsuzaki
Staff52L=KUM HAEHYUN
Staff52R=手塚 秀彰
Staff52_subR=Hideaki Tezuka
Staff53L=RAVEN
Staff53R=安元 洋貴
Staff53_subR=Hiroki Yasumoto
Staff55L=DIZZY
Staff55R=藤田 佳寿恵
Staff55_subR=Kazue Fujita
Staff56L=ZAPPA
Staff56R=うえだゆうじ
Staff56_subR=Yuuji Ueda
Staff57L=BAIKEN
Staff57R=浅野 まゆみ
Staff57_subR=Mayumi Asano
Staff58L=ROBO-KY
Staff58R=千葉 繁
Staff58_subR=Shigeru Chiba
Staff59L=DR. PARADIGM
Staff59R=幹本 雄之
Staff59_subR=Yuuji Mikimoto
Staff60L=GABRIEL
Staff60R=菅生 隆之
Staff60_subR=Takayuki Sugou
Staff61L=CHRONUS / RANDY
Staff61R=坪井 智徳
Staff61_subR=Tomonori Tsuboi
Staff62L=VERNON COLOUR
Staff62R=梁田 清之
Staff62_subR=Kiyoyuki Yanada
Staff63L=MAXIMUS ARIELS
Staff63R=皆川 純子
Staff63_subR=Junko Minagawa
Staff64L=THAT MAN
Staff64R=杉田 智和
Staff64_subR=Tomokazu Sugita
Staff65L=ANSWER
Staff65R=関 智一
Staff65_subR=Tomokazu Seki
Staff66L=DARYL
Staff66R=岩澤 俊樹
Staff66_subR=Toshiki Iwasawa
Staff67L=IAN
Staff67R=川原 慶久
Staff67_subR=Yoshihisa Kawahara
Staff68L=NEO / APRIL
Staff68R=磯村 知美
Staff68_subR=Tomomi Isomura
Staff70L=KEIT WHALTER
Staff70R=住友 優子
Staff70_subR=Yuuko Sumitomo
Staff71L=KADOOKI
Staff71R=関 智一
Staff71_subR=Tomokazu Seki
Staff72L=MAJOR. RYLE
Staff72R=坪井 智徳
Staff72_subR=Tomonori Tsuboi
Staff73L=MAGEHOUND
Staff73R=磯村 知美
Staff73_subR=Tomomi Isomura
Staff74L=DEPUTY DIRECTOR
Staff74R=近藤 隆
Staff74_subR=Takashi Kondou
Staff76L=ANDERS
Staff76R=潘 めぐみ
Staff76_subR=Megumi Han
Staff77L=TREY
Staff77R=川原 慶久
Staff77_subR=Yoshihisa Kawahara
Staff78L=ELLSWORTH
Staff78R=高橋 信
Staff78_subR=Makoto Takahashi
Staff79L=ALEXIS
Staff79R=藤川 茜
Staff79_subR=Akane Fujikawa
Staff80L=MASTER OF CEREMONIES
Staff80R=梁田 清之
Staff80_subR=Kiyoyuki Yanada
Staff81L=SWORDSMAN
Staff81R=関 智一
Staff81_subR=Tomokazu Seki
Staff82L=CONVICT HAMMER
Staff82R=梁田 清之
Staff82_subR=Kiyoyuki Yanada
Staff83L=GAUNTLET BODY
Staff83R=杉田 智和
Staff83_subR=Tomokazu Sugita
Staff84R=坪井 智徳
Staff84_subR=Tomonori Tsuboi
Staff85R=梁田 清之
Staff85_subR=Kiyoyuki Yanada
Staff86L=GUARD
Staff86R=川原 慶久
Staff86_subR=Yoshihisa Kawahara
Staff88L=SHARON
Staff88R=潘 めぐみ
Staff88_subR=Megumi Han
Staff89L=AUGUS
Staff89R=住友 優子
Staff89_subR=Yuuko Sumitomo
Staff90L=JUNE
Staff90R=潘 めぐみ
Staff90_subR=Megumi Han
Staff91L=SEPHY&MARCH
Staff91R=藤川 茜
Staff91_subR=Akane Fujikawa
Staff92L=FERBY&NOVEL&OCTY&JANIS
Staff92R=松本 夕紀
Staff92_subR=Yuuki Matsumoto
Staff93L=KY'S GUARDS
Staff93R=関 智一
Staff93_subR=Tomokazu Seki
Staff94L=ILLYRIA PEAPLE
Staff94R=近藤 隆
Staff94_subR=Takashi Kondou
Staff95R=磯村 知美
Staff95_subR=Tomomi Isomura
Staff96R=関 智一
Staff96_subR=Tomokazu Seki
Staff98L=NARRATION
Staff98R=菅生 隆之
Staff98_subR=Takayuki Sugou
Staff99L=SYSTEM VOICE
Staff99R=Dan Rubida
Staff99_subR=Dan Rubida
Staff102L=DEVELOPMENT STAFF
Staff104L=logo_RED
Staff107L=Game Design&Character Design
Staff107R=石渡 太輔
Staff107_subR=Daisuke Ishiwatari
Staff109L=Products Planning
Staff109R=石渡 太輔
Staff109_subR=Daisuke Ishiwatari
Staff110R=山中 丈嗣
Staff110_subR=Takeshi Yamanaka
Staff112L=Art Director
Staff112R=坂村 英彦
Staff112_subR=Hidehiko Sakamura
Staff113L=Technical Artist
Staff113R=本村 C. 純也
Staff113_subR=Junya C. Motomura
Staff114L=Lead Programmer
Staff114R=家弓 拓郎
Staff114_subR=Takuro Kayumi
Staff115L=Lead Planner
Staff115R=関根 一利
Staff115_subR=Kazuto Sekine
Staff116L=Lead Environment Artist
Staff116R=儘田 元気
Staff116_subR=Genki Mamada
Staff117L=Lead Effect Artist
Staff117R=小川 和哉
Staff117_subR=Kazuya Ogawa
Staff118L=Lead HUD Artist
Staff118R=小山 健太郎
Staff118_subR=Kentaro Koyama
Staff121L=Project Manager
Staff121R=山中 丈嗣
Staff121_subR=Takeshi Yamanaka
Staff124L=Lead Planner
Staff124R=関根 一利
Staff124_subR=Kazuto Sekine
Staff125L=Planners
Staff125R=片野 旭
Staff125_subR=Akira Katano
Staff126R=岡本 隆二
Staff126_subR=Ryuji Okamoto
Staff127R=中野 雅広
Staff127_subR=Masahiro Nakano
Staff128R=荒川 拓馬
Staff128_subR=Takuma Arakawa
Staff129R=田中 貴士
Staff129_subR=Takashi Tanaka
Staff132L=Lead Programmer
Staff132R=家弓 拓郎
Staff132_subR=Takuro Kayumi
Staff133L=Programmers
Staff133R=岡本 隆二
Staff133_subR=Ryuji Okamoto
Staff134R=野沢 武史
Staff134_subR=Takeshi Nozawa
Staff135R=廣田 淳司
Staff135_subR=Atsushi Hirota
Staff136R=大里 亮太
Staff136_subR=Ryouta Oosato
Staff139L=Lead 2D Artist
Staff139R=郷間 幸範
Staff139_subR=Yukinori Gouma
Staff140L=2D Artists
Staff140R=澤田 秀明
Staff140_subR=Hideaki Sawada
Staff141R=浅野 健太
Staff141_subR=Kenta Asano
Staff144L=Lead HUD Artist
Staff144R=小山 健太郎
Staff144_subR=Kentaro Koyama
Staff145L=HUD Artists
Staff145R=田中 晴香
Staff145_subR=Haruka Tanaka
Staff146R=浅野 健太
Staff146_subR=Kenta Asano
Staff149L=Lead 3D Modeler
Staff149R=本村 C. 純也
Staff149_subR=Junya C. Motomura
Staff150L=3D Modelers
Staff150R=川崎 壮一
Staff150_subR=Souichi Kawasaki
Staff151R=金 喆
Staff151_subR=Tetsu Kin
Staff152R=山中 岳史
Staff152_subR=Takashi Yamanaka
Staff155L=Lead 3D Animator
Staff155R=坂村 英彦
Staff155_subR=Hidehiko Sakamura
Staff156L=3D Animators
Staff156R=坪井 利浩
Staff156_subR=Toshihiro Tsuboi
Staff157R=夏 叶
Staff157_subR=You Xia
Staff158R=権坐 英明
Staff158_subR=Hideaki Gonza
Staff161L=Lead Effect Artist
Staff161R=小川 和哉
Staff161_subR=Kazuya Ogawa
Staff162L=Effect Artist
Staff162R=鈴木 秀真
Staff162_subR=Hotsuma Suzuki
Staff165L=Lead Environment Artist
Staff165R=儘田 元気
Staff165_subR=Genki Mamada
Staff166L=Environment Artists
Staff166R=五十嵐 和也
Staff166_subR=Kazuya Igarashi
Staff167R=加藤 英治
Staff167_subR=Hideharu Kato
Staff168R=斎藤 豊
Staff168_subR=Yutaka Saito
Staff171L=Lead Sound Artist
Staff171R=佐藤 ノリチカ
Staff171_subR=Norichika Sato
Staff172L=Sound Artist
Staff172R=松田 芳明
Staff172_subR=Yoshiaki Matsuda
Staff178L=PUBLISHING STAFF
Staff180L=Publish
Staff180R=鈴木 美香
Staff180_subR=Mika Suzuki
Staff181R=斎藤 聡
Staff181_subR=Satoshi Saito
Staff182R=永島 靖啓
Staff182_subR=Yasuhiro Nagashima
Staff183R=須藤 夏葉
Staff183_subR=Natsuha Sudo
Staff184R=浅香 恵美子
Staff184_subR=Emiko Asaka
Staff186L=Publish Assistants
Staff186R=清水 幸一
Staff186_subR=Kouichi Shimizu
Staff187R=桑原 卓也
Staff187_subR=Takuya Kuwabara
Staff188R=佐藤 朱菜
Staff188_subR=Ayana Sato
Staff189R=幸村 葉子
Staff189_subR=Youko Koumura
Staff191L=User Support
Staff191R=福島 伸明
Staff191_subR=Nobuaki Fukushima
Staff192R=田口 和憲
Staff192_subR=Kazunori Taguchi
Staff194L=Marketing Producer
Staff194R=永田 厚二
Staff194_subR=Koji Nagata
Staff200L=SOUNDWORKS
Staff202L=Composers
Staff202R=石渡 太輔
Staff202_subR=Daisuke Ishiwatari
Staff203R=佐藤 ノリチカ
Staff203_subR=Norichika Sato
Staff205L=Incidental Music Composer
Staff205R=滝澤 俊輔 (Try Tone Lobo)
Staff205_subR=Syunsuke Takizawa
Staff206L=Sound Recording Engineer
Staff206R=渡辺 大志 (Try Tone Lobo)
Staff206_subR=Taishi Watanabe
Staff208L=Arranger
Staff208R=佐藤 ノリチカ
Staff208_subR=Norichika Sato
Staff210L=Vocal
Staff210R=橋本 直樹
Staff210_subR=NAOKI HASHIMOTO
Staff211L=Guitar
Staff211R=梶原 稔広
Staff211_subR=Toshihiro Kajihara
Staff212L=Bass
Staff212R=長谷川 淳
Staff212_subR=Atsushi Hasegawa
Staff213L=Piano
Staff213R=滝澤 俊輔
Staff213_subR=Syunsuke Takizawa
Staff214L=Violin
Staff214R=越川 歩
Staff214_subR=Ayumu Koshikawa
Staff216L=Sound Producer
Staff216R=鈴木 高雄 (Star Jam Corporation)
Staff216_subR=Takao Suzuki
Staff217L=Voiceactor Coordinate
Staff217R=栗山 健太 (Star Jam Corporation)
Staff217_subR=Kenta Kuriyama
Staff219L=Voice Recording Directors
Staff219R=石渡 太輔
Staff219_subR=Daisuke Ishiwatari
Staff220R=山中 丈嗣
Staff220_subR=Takeshi Yamanaka
Staff221R=田中 貴士
Staff221_subR=Takashi Tanaka
Staff223L=Voice Recording & Edit Engineer
Staff223R=渡辺 大志 (Try Tone Lobo)
Staff223_subR=Taishi Watanabe
Staff233L=OUTSOURCING STAFF
Staff235L=NEURON AGE Co.,Ltd.
Staff236L=Senior Designer
Staff236R=長澤 一
Staff236_subR=Hajime Nagasawa
Staff237L=Designers
Staff237R=福田 尚輝
Staff237_subR=Naoki Fukuda
Staff238R=山領 忠幸
Staff238_subR=Tadayuki Yamaryou
Staff239R=宮澤 路彰
Staff239_subR=Michiakira Miyasawa
Staff240R=瀧 翔平
Staff240_subR=Shohei Taki
Staff242L=Manager
Staff242R=冨士末　登喜夫
Staff242_subR=Tokio　Fujisue
Staff244L=Acting General Manager
Staff244R=二階 学
Staff244_subR=Manabu Nikai
Staff247L=Bean Pod Corp.
Staff248L=CG Director
Staff248R=大野 雅子
Staff248_subR=Masako Oono
Staff249L=CG Animators
Staff249R=磯谷 涼汰
Staff249_subR=Ryouta Isogai
Staff250R=伊藤 奈々美
Staff250_subR=Nanami Itou
Staff253L=SUCCESS BEIJING STUDIO
Staff256L= indigo line Co.,Ltd.
Staff257L=Animation Director
Staff257R=月見里 智弘
Staff257_subR=Tomohiro Tsukimisato
Staff260L=Barnhouse Effect Co.,Ltd.
Staff261L=HUD Artist
Staff261R=川島 哲
Staff261_subR=Satoru Kawashima
Staff264L=Silicon Studio
Staff265L=2D Environment Artist
Staff265R=佐藤 広太
Staff265_subR=Kouta Sato
Staff269L=TGS2015 Trailer Products
Staff271L=ADEX Design Center CO.,LTD.
Staff272L=Producer
Staff272R=坂井 誠一
Staff272_subR=Seiichi Sakai
Staff274L=IMAGICA Imageworks, Inc.
Staff275L=Associate Producers
Staff275R=濱崎 良太
Staff275_subR=Ryota Hamasaki
Staff276R=和田 初海
Staff276_subR=Hatsumi Wada
Staff278L=Motion Graphic Artist
Staff278R=堤 英彰
Staff278_subR=Hideaki Tsutsumi
Staff281L=Promotion Video Products
Staff283L=ADEX Design Center CO.,LTD.
Staff284L=Producer
Staff284R=坂井 誠一
Staff284_subR=Seiichi Sakai
Staff286L=IMAGICA Imageworks, Inc.
Staff287L=Associate Producers
Staff287R=濱崎 良太
Staff287_subR=Ryota Hamasaki
Staff288R=和田 初海
Staff288_subR=Hatsumi Wada
Staff290L=Motion Graphic Artist
Staff290R=川上 昌人
Staff290_subR=Masato Kawakami
Staff293L=Freelance
Staff295L=Background Artist
Staff295R=櫻井 純子
Staff295_subR=Junko Sakurai
Staff297L=Action Choreography
Staff297R=寺田 完
Staff297_subR=Yutaka Terada
Staff298R=井上 巧
Staff298_subR=Takumi Inoue
Staff300L=3D Animator
Staff300R=永野 覧
Staff300_subR=Ran Nagano
Staff302L=Movie Composite Adviser
Staff302R=Iris Motion Graphics.
Staff302_subR=Iris Motion Graphics.
Staff304L=Battle Balance Advisers
Staff304R=神園 雄太
Staff304_subR=Yuta Kamizono
Staff305R=佐藤 題
Staff305_subR=Shirushi Sato
Staff306R=木下 竜平
Staff306_subR=Ryuhei Kinoshita
Staff309L=Debugging Staff
Staff311L=DIGITAL Hearts
Staff312L=Debug Producer
Staff312R=荒井 勇樹
Staff312_subR=Yuki Arai
Staff313L=Chief Director
Staff313R=青木 健太
Staff313_subR=Kenta Aoki
Staff314L=Debug Director
Staff314R=横井 良輔
Staff314_subR=Ryousuke Yokoi
Staff315L=QA Lead
Staff315R=高橋 真一朗
Staff315_subR=Shinichiro Takahashi
Staff316R=足立 正洋
Staff316_subR=Masahiro Adachi
Staff317L=Debuggers
Staff317R=髙村 佳宏
Staff317_subR=Yoshihiro Takamura
Staff318R=和知 弘貴
Staff318_subR=Hiroki Wachi
Staff319R=水田 隆文
Staff319_subR=Takafumi Mizuta
Staff320R=中田 祐介
Staff320_subR=Yusuke Nakata
Staff321R=田中 孝幸
Staff321_subR=Takayuki Tanaka
Staff322R=松下 昌平
Staff322_subR=Shohei Matushita
Staff324L=DREAMS CORPORATION
Staff325L=Debuggers
Staff325R=畑 雄介
Staff325_subR=Yusuke Hata
Staff326R=山林 大祐
Staff326_subR=Daisuke Yamabayashi
Staff329L=Publishing Support
Staff331L=Exmind, Inc.
Staff332L=Advertisement Designers
Staff332R=松本 正子
Staff332_subR=Masako Matsumoto
Staff333R=佐藤 こぐり
Staff333_subR=Koguri Sato
Staff334R=佐藤 恵
Staff334_subR=Megumi Sato
Staff337L=Official Site
Staff339L=AWAKE CO.,LTD.
Staff342L=U.S. Localization & Publishing
Staff344L=Aksys Games
Staff345L=Executive Producer
Staff345R=謝 明志
Staff345_subR=Akibo Shieh
Staff346L=CFO
Staff346R=謝 道子
Staff346_subR=Michiko Shieh
Staff348L=Director of Production
Staff348R=フランク「ボー」デウィント
Staff348_subR=Frank ""Bo"" deWindt II
Staff349L=Localization Lead
Staff349R=山瀧 あすか
Staff349_subR=Asuka Yamataki
Staff350L=Localization Specialist
Staff350R=スティーブン・ハートリー
Staff350_subR=Stephen Hartley
Staff352L=QA Testing
Staff352R=デジタルハーツUSA
Staff352_subR=DIGITAL Hearts USA Inc.
Staff354L=Sales/Marketing/PR/Logistics
Staff354R=バーバラ・ヤング
Staff354_subR=Barbara Young
Staff355R=アリア・カロル
Staff355_subR=Alia Carroll
Staff356R=マイケル・クリストファーズ
Staff356_subR=Michael Christoffers
Staff357R=金子アン
Staff357_subR=Anne Kaneko
Staff358R=小林 奈緒美
Staff358_subR=Naomi Kobayashi
Staff359R=ダニー・ミスヴィッチ
Staff359_subR=Danny Miscevich
Staff360R=西 孝徳
Staff360_subR=Takanori Nishi
Staff362L=Special Thanks
Staff362R=江 明瑾
Staff362_subR=Andy Chiang
Staff363R=マイケル・イングラー
Staff363_subR=Michael Engler
Staff364R=カレン・マクオスカー
Staff364_subR=Karen McOscar
Staff367L=EU Localization & Publishing
Staff369L=PQube Ltd.
Staff370L=Head of Marketing
Staff370R=Geraint Evans
Staff370_subR=Geraint Evans
Staff371L=Production Manager
Staff371R=Harrison Lewis
Staff371_subR=Harrison Lewis
Staff372L=Product Assistant
Staff372R=Bryce Hsiao
Staff372_subR=Bryce Hsiao
Staff374L=PR
Staff374R=Peter Fury
Staff374_subR=Peter Fury
Staff376L=Graphic Designer
Staff376R=Daniel Bamford
Staff376_subR=Daniel Bamford
Staff378L=Community Management
Staff378R=Oscar Taylor-Kent
Staff378_subR=Oscar Taylor-Kent
Staff381L=Localization Staff
Staff383L=English Translator
Staff383R=マイキー マクナマラ
Staff383_subR=Mikey McNamara
Staff385L=Hangeul Localize
Staff387L=Musai Co.,Ltd.
Staff388L=Localization Manager
Staff388R=JaeWoon Yu
Staff388_subR=JaeWoon Yu
Staff391L=Special Thanks
Staff393L=ARC SYSTEM WORKS
Staff393R=遠藤 良平
Staff393_subR=Ryouhei Endou
Staff394R=杉山 治
Staff394_subR=Osamu Sugiyama
Staff395R=石川 辰則
Staff395_subR=Tatsunori Ishikawa
Staff396R=影山 博美
Staff396_subR=Hiromi Kageyama
Staff397R=前田 亨
Staff397_subR=Toru Maeda
Staff398R=川上 裕貴
Staff398_subR=Yuki Kawakami
Staff399R=小澤 陸
Staff399_subR=Riku Ozawa
Staff400R=相馬 峻
Staff400_subR=Shun Souma
Staff402R=井口屋 タクミ
Staff402_subR=Takumi Iguchiya
Staff403R=福本 征士
Staff403_subR=Seiji Fukumoto
Staff404R=小野 夢紀
Staff404_subR=Yumenori Ono
Staff405R=荒 真成
Staff405_subR=Masanari Ara
Staff407R=有馬 七助
Staff407_subR=Nanasuke Arima
Staff408R=伊藤 誠
Staff408_subR=Makoto Ito
Staff409R=須藤 朋子
Staff409_subR=Tomoko Sudo
Staff411_subL=ARC SYSTEM WORKS ALL STAFF
Staff413L=Sony Computer Entertainment Japan Asia
Staff414L=Technical Support
Staff414R=秋山 賢成
Staff414_subR=Kenjo Akiyama
Staff415R=鈴木 弘真
Staff415_subR=Hiromasa Suzuki
Staff416L=Account Manager
Staff416R=江田 祐人
Staff416_subR=Masato Koda
Staff417R=伊藤 道明
Staff417_subR=Michiaki Ito
Staff418L=PR
Staff418R=玉置 聡
Staff418_subR=Satoshi Tamaki
Staff419R=水上 亨
Staff419_subR=Toru Mizukami
Staff422L=Epic Games Japan
Staff423L=Territory Manager
Staff423R=河崎 高之
Staff423_subR=Taka Kawasaki
Staff424L=Support Manager
Staff424R=下田 純也
Staff424_subR=Jun Shimoda
Staff425L=Support Technical Artist
Staff425R=ロブ グレイ
Staff425_subR=Rob Gray
Staff426L=Support Engineer
Staff426R=ジョー コンリー
Staff426_subR=Joe Conley
Staff429L=SANWA DENSHI Co.,Ltd.
Staff431L=EXAR Corporation
Staff433L=Lab Zero Games
Staff437L=Ending Theme
Staff439L=""All I Can Do""
Staff440L=Composer
Staff440R=石渡 太輔
Staff440_subR=Daisuke Ishiwatari
Staff441L=Arranger
Staff441R=佐藤 ノリチカ
Staff441_subR=Norichika Sato
Staff442L=Lyrics
Staff442R=石渡 太輔
Staff442_subR=Daisuke Ishiwatari
Staff443L=English Lyrics
Staff443R=本村 C. 純也
Staff443_subR=Junya C. Motomura
Staff445L=Vocal
Staff445R=橋本 直樹
Staff445_subR=Naoki Hashimoto
Staff446L=Guitar
Staff446R=梶原 稔広
Staff446_subR=Toshihiro Kajihara
Staff447L=Bass
Staff447R=長谷川 淳
Staff447_subR=Atsushi Hasegawa
Staff451L=logo_UE3
Staff462L=ARC SYSTEM WORKS
Staff463L=Line Producer
Staff463R=森 利道
Staff463_subR=Toshimichi Mori
Staff464R=田口 和憲
Staff464_subR=Kazunori Taguchi
Staff466L=Marketing Producer
Staff466R=永田 厚二
Staff466_subR=Kouji Nagata
Staff468L=Executive Producer
Staff468R=木戸岡 稔
Staff468_subR=Minoru Kidooka
Staff470L=Production Director
Staff470R=山中 丈嗣
Staff470_subR=Takeshi Yamanaka
Staff472L=General Director
Staff472R=石渡 太輔
Staff472_subR=Daisuke Ishiwatari
Staff483L=logo_arc
